---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GridCenterSegmentWeight
source: html/cac52e2a-b24c-fa6d-419f-9c1efc42578b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GridCenterSegmentWeight Property

"Center Segment Weight"

## Syntax (C#)
```csharp
public static ForgeTypeId GridCenterSegmentWeight { get; }
```